Autodesk.Revit.DB.Structure.StructuralConnectionType.ValidFamilySymbolId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo,Autodesk.Revit.DB.ElementId)
Checks whether the family symbol id is allowed for
StructuralConnectionTypes with the given value for the applyTo
property.
Returns:
True if %familySymbolId% is invalidElementId; or if it is
the id of a FamilySymbol of category "Connection
Symbols" (OST_StructConnectionSymbols) with its "Apply
To" parameter set to match the applyTo property.
Returns false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Structure.StructuralConnectionType.SetFamilySymbolId(Autodesk.Revit.DB.ElementId)
FamilySymbol of the annotation to use for this connection type.
Remarks:
The FamilySymbol must be of category "Connection Symbols"
(OST_StructConnectionSymbols) and have its "Apply
To" parameter set to match the applyTo property.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when familySymbolId is the id of some element that is not a
FamilySymbol, is not of the category "Connection
Symbols" (OST_StructConnectionSymbols), or has its "Apply
To" parameter not equal to this type's applyTo property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralConnectionType.GetAllStructuralConnectionTypeIds(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId}@)
Collects the ids of all StructuralConnectionTypes in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.StructuralConnectionType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo,System.String,Autodesk.Revit.DB.ElementId)
Create a new StructuralConnectionType, allowing the specified
annotation FamilySymbol to be applied to structural members.
applyTo:
Specify which type of member this connection type can be applied to.
name:
A name for the connection type. It must be unique within the document.
familySymbolId:
The id of an annotation FamilySymbol. InvalidElementId is
allowed. Otherwise, the FamilySymbol must
be in the category "Connection Symbols"
(OST_StructConnectionSymbols) and have its "Apply
To" parameter set to match the applyTo argument.
Throws Autodesk.Revit.Exceptions.ArgumentException:
familySymbolId is the id of some element that is not a
FamilySymbol, is not of the category "Connection
Symbols" (OST_StructConnectionSymbols), or has its "Apply
To" parameter not equal to applyTo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011